@rileygriffith did you build the latest master and override the provider properly?  Your configuration was created successfully in my testing

```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the
following symbols:
  + create

Terraform will perform the following actions:

  # datadog_dashboard.api_health_dashboard will be created
  + resource "datadog_dashboard" "api_health_dashboard" {
      + dashboard_lists_removed = (known after apply)
      + description             = "Created using the Datadog provider in Terraform"
      + id                      = (known after apply)
      + is_read_only            = false
      + layout_type             = "ordered"
      + title                   = "API Gateways - rand"
      + url                     = (known after apply)

      + widget {
          + id = (known after apply)

          + group_definition {
              + background_color = "vivid_blue"
              + layout_type      = "ordered"
              + show_title       = true
              + title            = "Synthetic Testing for Cyndx APIs"

              + widget {
                  + id = (known after apply)

                  + slo_list_definition {
                      + request {
                          + request_type = "slo_list"

                          + query {
                              + limit = 100
                            }
                        }
                    }

                  + widget_layout {
                      + height = 3
                      + width  = 4
                      + x      = 4
                      + y      = 0
                    }
                }
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

datadog_dashboard.api_health_dashboard: Creating...
datadog_dashboard.api_health_dashboard: Creation complete after 1s [id=e76-qbu-8b2]

Apply complete! Resources: 1 added, 0 changed, 0 destroyed.
```